# 날짜/시간 -> 모듈 활용
- 날짜와 시간은 기준점이 될 수 있어서 이 부분은 모듈 불러와 사용
- import time
- time에는 여러 메서드들이 있다
- localtime, datetime 등등

In [1]:
import time

In [18]:
time.time() # 1970년 기준 현재의 시간이 초 단위로 변화

1711522723.0445251

In [52]:
time.localtime(time.time())

time.struct_time(tm_year=2024, tm_mon=3, tm_mday=27, tm_hour=15, tm_min=59, tm_sec=31, tm_wday=2, tm_yday=87, tm_isdst=0)

- 날짜/시간 -> 포맷을 맞출 수 있다
- time.strftime()
- 포맷양식은 %Y, %y %m %d

In [57]:
time.strftime('%y-%m-%d', time.localtime(time.time())) # 소문자y 는 두자리

'24-03-27'

In [59]:
time.strftime('%Y-%m-%d', time.localtime(time.time())) # 대문자Y 는 네자리

'2024-03-27'

In [60]:
time.strftime('%a', time.localtime(time.time())) #요일

'Wed'

In [61]:
time.strftime('%H', time.localtime(time.time())) #시각

'16'

In [62]:
time.strftime('%p', time.localtime(time.time())) # am, pm

'PM'

### datetime 모듈로 현재 날짜와 시간을 구할 수 있음

In [63]:
import datetime

In [64]:
datetime.datetime.today()

datetime.datetime(2024, 3, 27, 16, 3, 26, 911653)

- 특정 날짜를 포맷팅 할 수 있음

In [65]:
datetime.datetime.strptime('2024-03-27', '%Y-%m-%d')

datetime.datetime(2024, 3, 27, 0, 0)

- 날짜와 시간 계산

In [66]:
d_day = datetime.datetime(2024,3,27)

In [67]:
d_day

datetime.datetime(2024, 3, 27, 0, 0)

- timedelta 모듈 사용해서 값을 더하거나 뺄 수 있음

In [69]:
from datetime import timedelta

In [70]:
timedelta(days=13)

datetime.timedelta(days=13)

In [71]:
d_day

datetime.datetime(2024, 3, 27, 0, 0)

In [72]:
d_day - timedelta(days=13)

datetime.datetime(2024, 3, 14, 0, 0)

In [73]:
datetime.datetime(2024,3,27) - datetime.datetime(2023,3,27)

datetime.timedelta(days=366)

---
### timedelta 사용 이유
- 30, 31 이후에는 월이 바뀐다.
- 계산이 수치형으로 하면 32..33. 증가한다.
- 날짜로 생각을 안 하면 이런 경우 에러가 발생할 수 있다.
- 1/31 - 2월로 보거나, 15- 20일을 빼면 날짜가 아니면 -5가 나온다. 날짜 바라봐야 월이 변경이 된다.

In [77]:
import seaborn as sns
import pandas as pd

In [81]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [86]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [82]:
import re

In [83]:
df.Name.str.extract('([A-Za-z]+)\.',expand=True)

AttributeError: 'DataFrame' object has no attribute 'Name'

## 데이터 분석의 데이터를 요약해주는 나만의 함수 만들기
- 판다스 문법을 좀 알아야 하지만, 함수를 만드는 원리는 동일
####
- 데이터를 요약할 수 있는 함수
- 이 함수는 내가 원하는 데이터를 요약해서 보여주는 것
- 특정 범주형 변수는 카운팅을 해서 보여주고
- 숫자형 데이터는 describe를 통해 요약해서 보여주는 것